<!--  ข้อ 1.1 -->

<?php
	for ($i = 1; $i <= 5; $i++) { 
		for ($j = 1; $j <= 5; $j++) { 
			if($j <= ( 5 - $i )) { 
				echo " "." "; 
					
			} else { 
				echo "O "; 
			} 
				
		} 
		echo "\n";
	} 
?>

<!-- ข้อ 1.2 -->

<?php
	$k = 4 * 2 - 4; 
  
	for ($i = 0; $i < 9; $i++) { 
		if($i !== 1 && $i !== 3 && $i !== 5 && $i !== 7 ) {

			for ($j = 0; $j < $k; $j++) {
				echo " ". " "; 
			}
	
			$k = $k - 1; 
	
			for ($j = 0; $j <= $i; $j++) { 
				echo "O "; 
			} 

			echo "\n"; 
		}
	} 
?>